package de.tubs.hirakanaji.core;

/**
 * @author lisa-rosenberg
 * @since 13.05.2018
 */
public class HiraganaDataSet {

    public static final String[][] hiraganaChars = new String[0][0];

    public static final String[][] hiraganaData = new String[][] {
            {"あ", "い", "う", "え", "お"},

            {"か", "き", "く", "け", "こ"},
            {"が", "ぎ", "ぐ", "げ", "ご"},

            {"さ", "し", "す", "せ", "そ"},
            {"ざ", "じ", "ず", "ぜ", "ぞ"},

            {"た", "ち", "つ", "て", "と"},
            {"だ", "ぢ", "づ", "で", "ど"},

            {"な", "に", "ぬ", "ね", "の"},

            {"は", "ひ", "ふ", "へ", "ほ"},
            {"ば", "び", "ぶ", "べ", "ぼ"},
            {"ぱ", "ぴ", "ぷ", "ぺ", "ぽ"},

            {"ま", "み", "む", "め", "も"},

            {"や",       "ゆ",       "よ"},

            {"ら", "り", "る", "れ", "ろ"},

            {"わ",                   "を"},

            {"ん"},
    };

    public static final String[][] hiraganaExtraData = new String[][] {
            {"きゃ", "きゅ",        "きょ"},
            {"ぎゃ", "ぎゅ",        "ぎょ"},

            {"にゃ", "にゅ",        "にょ"},

            {"ひゃ", "ひゅ",        "ひょ"},

            {"びゃ", "びゅ",        "びょ"},
            {"ぴゃ", "ぴゅ",        "ぴょ"},

            {"みゃ", "みゅ",        "みょ"},

            {"りゃ", "りゅ",        "りょ"},

            {"じゃ", "じゅ", "じぇ", "じょ"},

            {"ちゃ", "ちゅ", "ちぇ", "ちょ"},

            {"しゃ", "しゅ", "しぇ", "しょ"},
    };

}
